{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 64, 64, 3], "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "padding": "valid", "filters": 32, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_1"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"batch_input_shape": [null, 64, 64, 3], "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "padding": "valid", "filters": 32, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "activation": "relu", "units": 128, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "activation": "relu", "units": 128, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "activation": "sigmoid", "units": 1, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "dense_3"}}], "name": "sequential_1"}}